//+------------------------------------------------------------------+
//|                                                        Свеча.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
class Свеча
  {
private:
   double тело_свечи;
   int  номер_свечи;
   ENUM_TIMEFRAMES таймфрейм;
public:
                     Свеча(int _номер_свечи, ENUM_TIMEFRAMES _таймфрейм);
                    ~Свеча();
   short             Фильтр();
   double            Сигнал();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Свеча::Свеча(int _номер_свечи, ENUM_TIMEFRAMES _таймфрейм)
  {
  тело_свечи=0;
  таймфрейм = _таймфрейм;
  номер_свечи = _номер_свечи;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Свеча::~Свеча()
  {
  }
//+------------------------------------------------------------------+

short Свеча::Фильтр()
  {
  тело_свечи = iClose(Symbol(), таймфрейм, номер_свечи)-iOpen(Symbol(), таймфрейм, номер_свечи);
  if(тело_свечи>0)
   return (1);
  if(тело_свечи<0)
   return (-1);
  return 0;  
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
double Свеча::Сигнал()
  {
   if(Фильтр()==1)
      return (iLow(Symbol(), таймфрейм, 1));
   if (Фильтр()==-1)
      return (iHigh(Symbol(), таймфрейм, 1));         
   return(0);   
  }
//+------------------------------------------------------------------+
