//+------------------------------------------------------------------+
//|                                                        Зебра.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict

#include "Свеча.mqh"
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
class Зебра
  {
private:
   int                     количество;
   ENUM_НАПРАВЛЕНИЕ_СВЕЧИ  направление[];
   ENUM_TIMEFRAMES         таймфрейм;
   ENUM_СИМВОЛЫ            инструмент;
   void                    РасчитатьПолосы();
public:
   short             Фильтр();
   double            Сигнал();
                     Зебра(ENUM_СИМВОЛЫ _инструмент, int _количество, ENUM_TIMEFRAMES _символ);
                    ~Зебра();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Зебра::Зебра(ENUM_СИМВОЛЫ _инструмент, int _количество, ENUM_TIMEFRAMES _таймфрейм)
  {
   инструмент = _инструмент;
   количество=_количество;
   таймфрейм = _таймфрейм;
   ArrayResize(направление,количество);
   for(int i=0; i<количество; i++)
     {
      направление[i]=0;
      }
   
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Зебра::~Зебра()
  {
  }
//+------------------------------------------------------------------+
void Зебра::РасчитатьПолосы()
  {
   Свеча *полоса;
   
   for(int i=0; i<количество; i++)
     {
      полоса=new Свеча(инструмент,i+1,таймфрейм);
      направление[i]=полоса.Направление();
     }
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
short Зебра::Фильтр()
  {
   this.РасчитатьПолосы();
   for(int i=0; i<количество; i++)
     {
      if(i==0)
         continue;
      if(направление[i]==направление[i-1]) //если направление в 2-х соседних свечах совпадает, то это не зебра Вместо 1 нужно вводить параметр по количеству свечей
         return 0;
     }
   
   return (MathPow(-1,(количество+1))*направление[количество-1]);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
double Зебра::Сигнал()
  {
   if(Фильтр()==1)
      return (Low[1]);
   if(Фильтр()==-1)
      return (High[1]);
   return(0);
  }
//+------------------------------------------------------------------+
