//+------------------------------------------------------------------+
//|                                                     ЧетНечет.mq4 |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict

#include  "Пик.mqh"
#include  "Фрактал.mqh"
#include  "КомнатаФракталов.mqh"
#include  "ОфисФракталов.mqh"
#include  "Сделка.mqh"
#include  "ТорговоеВремя.mqh"
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
enum СигналыОткрытия
  {
   свечиСО,
   фракталыСО,
   пикиСО,
   линииТрендаСО,
   обратныеЛинииТрендаСО
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
enum ВремяЖизни
  {
   M1=1,
   M5=5,
   M15=15,
   M30=30,
   H1=60
  };

input int НАЧАЛО_РАБОТЫ=8;
input int ДЛИТЕЛЬНОСТЬ_РАБОТЫ=3; //Количество рабочих часов
input datetime ВРЕМЯ_ЗАПИСИ="2015.02.17 00:00";//Момент записи результатов в файл
input ВремяЖизни ВРЕМЯ_ЖИЗНИ=5; //Время жизни сделки
input int ПРОЦЕНТ_ДИВИДЕНДОВ= 80;

input СигналыОткрытия СИГНАЛЫ_ОТКРЫТИЯ=фракталыСО;
input int СВЕЧИ_СЛЕВА_ПИК1=3;
input int СВЕЧИ_СПРАВА_ПИК1= 3;
input int СВЕЧИ_СЛЕВА_ПИК2 = 1;
input int СВЕЧИ_СПРАВА_ПИК2= 1;
input int СВЕЧИ_СЛЕВА_ПИК3 = 1;
input int СВЕЧИ_СПРАВА_ПИК3= 1;

Пик   *pikL1,*pikL2,*pikL3;
ОфисФракталов *officeL;
КомнатаФракталов *roomL;

Пик   *pikH1,*pikH2,*pikH3;
ОфисФракталов *officeH;
КомнатаФракталов *roomH;
Сделка *buy,*sell;

string файлРезультатов="";
int новыйДень=0;
int количество_тиков_дня=0;

datetime времяНовойСвечи=0;
int количество_тиков_свечи=0;

datetime времяНачалаРаботы,времяКонцаРаботы;
bool записалРезультаты=false;
//+------------------------------------------------------------------+
//| Expert initialization function                                   |
//+------------------------------------------------------------------+

int OnInit()
  {
   pikL1=new Пик(СВЕЧИ_СПРАВА_ПИК1,СВЕЧИ_СЛЕВА_ПИК1,0,0,clrRed, 0);
   pikL2=new Пик(СВЕЧИ_СПРАВА_ПИК2,СВЕЧИ_СЛЕВА_ПИК2,0,0,clrYellow, 1);
   pikL3=new Пик(СВЕЧИ_СПРАВА_ПИК3,СВЕЧИ_СЛЕВА_ПИК3,0,0,clrBlue, 2);
   officeL=new ОфисФракталов();
   roomL=new КомнатаФракталов();

   pikH1=new Пик(СВЕЧИ_СПРАВА_ПИК1,СВЕЧИ_СЛЕВА_ПИК1,0,1,clrRed, 0);
   pikH2=new Пик(СВЕЧИ_СПРАВА_ПИК2,СВЕЧИ_СЛЕВА_ПИК2,0,1,clrYellow, 1);
   pikH3=new Пик(СВЕЧИ_СПРАВА_ПИК3,СВЕЧИ_СЛЕВА_ПИК3,0,1,clrBlue, 2);
   officeH=new ОфисФракталов();
   roomH=new КомнатаФракталов();

   buy=new Сделка(покупка);
   sell=new Сделка(продажа);
   файлРезультатов="Результаты "+Symbol()+IntegerToString(Period())+".csv";
   return(INIT_SUCCEEDED);
  }
//+------------------------------------------------------------------+
//| Expert deinitialization function                                 |
//+------------------------------------------------------------------+
void OnDeinit(const int reason)
  {
//---
   string строкаРезультат=РезультатыВСтроку(ПРОЦЕНТ_ДИВИДЕНДОВ);
   строкаРезультат=строкаРезультат+ПараметрыВСтроку();
   ЗаписатьРезультаты(файлРезультатов,строкаРезультат);
   записалРезультаты=true;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+

void OnTick()
  {
   if(TimeCurrent()>времяКонцаРаботы || времяКонцаРаботы==0)
      if(НовыйДень(новыйДень,количество_тиков_дня))
        {
         MqlDateTime timeCurrStruct;
         TimeToStruct(TimeCurrent(),timeCurrStruct);
         MqlDateTime timeBeginStruct=timeCurrStruct;
         timeBeginStruct.hour=НАЧАЛО_РАБОТЫ;
         
         времяНачалаРаботы= StructToTime(timeBeginStruct);
         времяКонцаРаботы = времяНачалаРаботы+ДЛИТЕЛЬНОСТЬ_РАБОТЫ*3600;
        }

   if(НоваяСвеча(времяНовойСвечи,количество_тиков_свечи))
     {
      Comment(времяНачалаРаботы,"\n",времяКонцаРаботы,"\n",TimeCurrent());
      if(TimeCurrent()>=времяНачалаРаботы && TimeCurrent()<времяКонцаРаботы && 
         TimeDayOfWeek(времяКонцаРаботы)!=0 && TimeDayOfWeek(времяКонцаРаботы)!=6)
        {
         bool это_пикL1=pikL1.ОпределитьПик("L1");
         bool это_пикL2 = pikL2.ОпределитьПик("L2");
         bool это_пикL3 = pikL3.ОпределитьПик("L3");

         bool это_пикH1 = pikH1.ОпределитьПик("H1");
         bool это_пикH2 = pikH2.ОпределитьПик("H2");
         bool это_пикH3 = pikH3.ОпределитьПик("H3");

         //-------------------------------------------фракталыСО  ----------------------------------------------------
         if(СИГНАЛЫ_ОТКРЫТИЯ==фракталыСО)
           {
            if(это_пикL1 && СИГНАЛЫ_ОТКРЫТИЯ==фракталыСО)
              {
               roomL=officeL.ОткрытьКомнату(1,pikL1);
              }

            if(это_пикL2)
              {
               roomL=officeL.ДобавитьВКомнаты(2,pikL2);
               officeL.УдалитьСмежныеКомнаты(2);
              }
            if(это_пикL3)
              {
               roomL=officeL.ДобавитьВКомнаты(3,pikL3);
               if(roomL.ЕстьФракталСТипом(3))
                 {
                  buy.ОткрытьСделку(1);
                  officeL.УдалитьЗакрытыеКомнаты();
                 }
              }
            if(это_пикH1)
              {
               roomH=officeH.ОткрытьКомнату(1,pikH1);
              }

            if(это_пикH2)
              {
               roomH=officeH.ДобавитьВКомнаты(2,pikH2);
               officeH.УдалитьСмежныеКомнаты(2);
              }
            if(это_пикH3)
              {
               roomH=officeH.ДобавитьВКомнаты(3,pikH3);
               if(roomH.ЕстьФракталСТипом(3))
                 {
                  sell.ОткрытьСделку(2);
                  officeH.УдалитьЗакрытыеКомнаты();
                 }
              }
           }

         //-------------------------------------------пикиСО  ----------------------------------------------------
         if(СИГНАЛЫ_ОТКРЫТИЯ==пикиСО)
           {
            if(это_пикL1)
              {
               pikL1.ПоставитьСтрелку();
               buy.ОткрытьСделку(1);
               officeL.УдалитьЗакрытыеКомнаты();
              }
            if(это_пикH1)
              {
               pikH1.ПоставитьСтрелку();
               sell.ОткрытьСделку(2);
               officeH.УдалитьЗакрытыеКомнаты();
              }
           }
           //-------------------------------------------свечиСО  ----------------------------------------------------
           if(СИГНАЛЫ_ОТКРЫТИЯ==свечиСО)
           {
            if((Open[1]-Close[1])<0)
              {
               buy.ОткрытьСделку(1);
              }
            if((Open[1]-Close[1])>0)
              {
               sell.ОткрытьСделку(2);
             }
           }

         //Comment("Минимумы\n"+officeL.ОфисФракталовВСтроку()+"\n\n\n\n\nМаксимумы\n"+officeH.ОфисФракталовВСтроку());
        }
     }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
   if(TimeCurrent()>=ВРЕМЯ_ЗАПИСИ && !записалРезультаты)///определиться с моментом записи в файл
     {

      //всести в строку результат и историю
     }
   buy.ЗакрытьСделку(-1,ВРЕМЯ_ЖИЗНИ);
   sell.ЗакрытьСделку(-1,ВРЕМЯ_ЖИЗНИ);

  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
int Сдвиг(datetime time,int свечи_справа)
  {
   int счетчик=0;
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
   while(true)
     {
      if(time>=Time[счетчик])
         break;
      счетчик++;
     }
   return(счетчик-свечи_справа-1);
  }

string ПараметрыВСтроку()
  {
   string str=";СИГНАЛЫ_ОТКРЫТИЯ=;"+EnumToString(СИГНАЛЫ_ОТКРЫТИЯ)+
              ";СВЕЧИ_СЛЕВА_ПИК1=;"+IntegerToString(СВЕЧИ_СЛЕВА_ПИК1)+";СВЕЧИ_СПРАВА_ПИК1=;"+IntegerToString(СВЕЧИ_СПРАВА_ПИК1)+
              ";СВЕЧИ_СЛЕВА_ПИК2=;"+IntegerToString(СВЕЧИ_СЛЕВА_ПИК2)+";СВЕЧИ_СПРАВА_ПИК2=;"+IntegerToString(СВЕЧИ_СПРАВА_ПИК2)+
              ";СВЕЧИ_СЛЕВА_ПИК3=;"+IntegerToString(СВЕЧИ_СЛЕВА_ПИК3)+";СВЕЧИ_СПРАВА_ПИК3=;"+IntegerToString(СВЕЧИ_СПРАВА_ПИК3);
   return str;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
string РезультатыВСтроку(int дивиденды)
  {
   string str="";
   int прибыльныеПокупки = 0;
   int прибыльныеПродажи = 0;
   int убыточныеПокупки = 0;
   int убыточныеПродажи = 0;
   int нулевыеПокупки = 0;
   int нулевыеПродажи = 0;

   for(int i=0; i<OrdersHistoryTotal(); i++)
      //+------------------------------------------------------------------+
      //|                                                                  |
      //+------------------------------------------------------------------+
     {
      if(OrderSelect(i,SELECT_BY_POS,MODE_HISTORY))
        {
         switch(OrderType())
           {
            case OP_BUY:
               if(OrderProfit()>MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
               прибыльныеПокупки++;
               else if(OrderProfit()<-MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
                  убыточныеПокупки++;
               else if(OrderProfit()<MarketInfo(Symbol(),MODE_SPREAD)*OrderLots() && 
                  OrderProfit()>-MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
                  нулевыеПокупки++;

               break;
            case OP_SELL:
               if(OrderProfit()>MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
               прибыльныеПродажи++;
               else if(OrderProfit()<-MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
                  убыточныеПродажи++;
               else if(OrderProfit()<MarketInfo(Symbol(),MODE_SPREAD)*OrderLots() && 
                  OrderProfit()>-MarketInfo(Symbol(),MODE_SPREAD)*OrderLots())
                  нулевыеПродажи++;
               break;
           }

        }
     }
   double прибыльПокупки = double(прибыльныеПокупки)*дивиденды/100-double(убыточныеПокупки);
   double прибыльПродажи = double(прибыльныеПродажи)*дивиденды/100-double(убыточныеПродажи);
   str="Покупки=;"+DoubleToString(прибыльПокупки)+";Продажи=;"+DoubleToString(прибыльПродажи)+";Всего;"+OrdersHistoryTotal()+
       ";zeroBuy=;"+IntegerToString(нулевыеПокупки)+";profitBuy=;"+IntegerToString(прибыльныеПокупки)+";lossBuy=;"+IntegerToString(убыточныеПокупки)+
       ";zeroSell=;"+IntegerToString(нулевыеПродажи)+";profitSell=;"+IntegerToString(прибыльныеПродажи)+";lossSell=;"+IntegerToString(убыточныеПродажи);
   return str;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
void ЗаписатьРезультаты(string filename,string строкаРезультат)
  {
   int handle=ОткрытьФайлДляЗаписи(filename);
   FileSeek(handle,0,SEEK_END);
   uint   fw=FileWrite(handle,строкаРезультат);
   FileClose(handle);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
int ОткрытьФайлДляЗаписи(string filename)
  {
   int handle=FileOpen(filename,FILE_CSV|FILE_READ|FILE_WRITE,";");
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
   if(handle==-1)
     {                      // Неудача при открытии файла           
      PlaySound("Bzrrr.wav");          // Звуковое сопровождение      
      return(-1);       //если функция возвращает -1 то значит не удалось открыть файл                  
     }
   return(handle);
  }
//+------------------------------------------------------------------+
