//+------------------------------------------------------------------+
//|                                                      Чистюля.mq4 |
//|                                                   Пархейчук Д.А. |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Пархейчук Д.А."
#property link      ""
#property version   "1.00"
#property strict

#include "Подключение.mqh"

extern int ПРИБЫЛЬ= 10000;
extern int УБЫТОК = 10000;

extern string ПИК_ИМЯ="пики";
extern int ПИК_СВЕЧИ_СЛЕВА = 5;
extern int ПИК_СВЕЧИ_СПРАВА = 1;

extern ENUM_TIMEFRAMES БДЖ_ТАЙМФРЕЙМ=0;
extern int БДЖ_ПЕРИОД=0;
extern double БДЖ_ОТКЛОНЕНИЕ=0;
extern int БДЖ_ДИСТАНЦИЯ=0;
extern int БДЖ_СДВИГ=0;
extern int БДЖ_НОМЕР_ТОЧКИ=0;

extern ENUM_ТЕСТОВЫЙ_ПАРАМЕТР ТЕСТОВЫЙ_ПАРАМЕТР=тест_общая_прибыль;
STRUCT_ПОРЦИЯ_СДЕЛОК porcy;
Пик *pik_down, *pik_up;
КомнатаСделок *buyRoom,*sellRoom;
Сделка *buy,*sell;
ЛинииБоуленджера *bollinger_line_up,*bollinger_line_down;
Свеча *candle;
ENUM_СИМВОЛЫ symbol=GBPUSD;
double TESTER_МОЩНОСТЬ;

double тело_свечи;
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
double OnTester()
  {
   double чистая_прибыль=TesterStatistics(STAT_PROFIT);
   double максимальная_просадка=TesterStatistics(STAT_EQUITY_DD);
   double общая_прибыль=TesterStatistics(STAT_GROSS_PROFIT);
/*if(чистая_прибыль<=0)
      return 0;
   if(максимальная_просадка!=0)
      TESTER_МОЩНОСТЬ=чистая_прибыль/максимальная_просадка;

   TESTER_МОЩНОСТЬ=MathRound(TESTER_МОЩНОСТЬ*100)/100;**/

   return общая_прибыль;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
int OnInit()
  {
//---
   bollinger_line_up=new ЛинииБоуленджера(сигнал_вверх,БДЖ_ТАЙМФРЕЙМ,БДЖ_ПЕРИОД,БДЖ_ОТКЛОНЕНИЕ,БДЖ_СДВИГ,БДЖ_ДИСТАНЦИЯ,БДЖ_НОМЕР_ТОЧКИ);
   bollinger_line_down=new ЛинииБоуленджера(сигнал_вниз,БДЖ_ТАЙМФРЕЙМ,БДЖ_ПЕРИОД,БДЖ_ОТКЛОНЕНИЕ,БДЖ_СДВИГ,БДЖ_ДИСТАНЦИЯ,БДЖ_НОМЕР_ТОЧКИ);
   buy=new Сделка(OP_BUY,symbol,false,0.01,ПРИБЫЛЬ,УБЫТОК,0,00000,clrDarkSlateGray,0,0);
   sell=new Сделка(OP_SELL,symbol,false,0.01,ПРИБЫЛЬ,УБЫТОК,0,11111,clrFireBrick,0,0);
   pik_up = new Пик(ПИК_СВЕЧИ_СПРАВА, ПИК_СВЕЧИ_СЛЕВА, 0, true, clrFireBrick, 3);
   pik_down = new Пик(ПИК_СВЕЧИ_СПРАВА, ПИК_СВЕЧИ_СЛЕВА, 0, false, clrAqua, 3);
   candle=new Свеча(symbol,1,Period());

//---
   return(INIT_SUCCEEDED);
  }
//+------------------------------------------------------------------+
//| Expert deinitialization function                                 |
//+------------------------------------------------------------------+
void OnDeinit(const int reason)
  {
//---

  }
//+------------------------------------------------------------------+
//| Expert tick function                                             |
//+------------------------------------------------------------------+
void OnTick()
  {
   if(buy.КоличествоСделок()==0)
      buyRoom=new КомнатаСделок();
   else 
      buyRoom.ИзменитьЦенуУбытка(bollinger_line_up.ПоказатьУровень());

   if(sell.КоличествоСделок()==0)
      sellRoom=new КомнатаСделок();
   else
      sellRoom.ИзменитьЦенуУбытка(bollinger_line_down.ПоказатьУровень());

   if(TimeCurrent()==Time[0])
     {
      if(pik_down.ОпределитьПик(ПИК_ИМЯ)/*&&buy.КоличествоСделок()==0*/)
        {
         pik_down.ПоставитьСтрелку();
         buy.ОткрытьСделку(0);
         buyRoom.ДобавитьСделку(buy);
        }

      if(pik_up.ОпределитьПик(ПИК_ИМЯ)/*&&sell.КоличествоСделок()==0*/)
        {
         pik_up.ПоставитьСтрелку();
         sell.ОткрытьСделку(0);
         sellRoom.ДобавитьСделку(sell);
        }

     }

  }
//+------------------------------------------------------------------+
