//+------------------------------------------------------------------+
//|                                                   Контратака.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                              http://www.mql4.com |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      "http://www.mql4.com"
#property version   "1.00"
#property strict

#include "Сделка.mqh"
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
class Контратака
  {
private:
   double            нижний_порог_нуля;//в пунктах
   double            верхний_порог_нуля;
   int               количество_убытков;
   double            прибыли[];
   int               индекс;
   bool              результат;
   void              ОбнулитьКонтратаку();
public:
                     Контратака(double _нижний_порог,double верхний_порог,int _количество);
                    ~Контратака();
   void              ДобавитьСделку(Сделка *_сделка);
   bool              РезультатКонтратаки();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Контратака::Контратака(double _нижний_порог,double _верхний_порог,int _количество)
  {
   нижний_порог_нуля=_нижний_порог*Point;
   верхний_порог_нуля= _верхний_порог*Point;
   количество_убытков=_количество;
   ArrayResize(прибыли,_количество);
   this.ОбнулитьКонтратаку();
   индекс=0;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+

Контратака::~Контратака()
  {
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
//+------------------------------------------------------------------+
void              Контратака::ДобавитьСделку(Сделка *_сделка)
  {
   bool выбор=OrderSelect(_сделка.ТикетСделки(),SELECT_BY_TICKET,MODE_HISTORY);
   if(OrderCloseTime()>0)
     {
      if(OrderProfit()<нижний_порог_нуля)
        {
         if(индекс<=(количество_убытков-1))
            прибыли[индекс]=OrderProfit();
         индекс++;
        }
      else if(OrderProfit()>верхний_порог_нуля)
        {
         this.ОбнулитьКонтратаку();
        }
     }
   Comment("Прибыль от сделки ",OrderType()," составляет: ",OrderProfit(),"\nиндекс = ",индекс,"\nколичество = ",количество_убытков);

  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
bool Контратака::РезультатКонтратаки()
  {
   if(индекс>(количество_убытков-1))
     {
      Print("Контратака");
      this.ОбнулитьКонтратаку();

      return(true);
     }
   else
      return(false);
  }
//+------------------------------------------------------------------+

void              Контратака::ОбнулитьКонтратаку()
  {
   for(int i=0; i<количество_убытков;i++)
      прибыли[i]=(нижний_порог_нуля+верхний_порог_нуля)*Point/2;
   индекс=0;
  }
//+------------------------------------------------------------------+
