//+------------------------------------------------------------------+
//|                                                        Зебра.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict

#include "Свеча.mqh"
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
class Зебра
  {
private:
   int               число_полос;
   short             полосы[];
   ENUM_TIMEFRAMES   таймфрейм;
   void              РасчитатьПолосы();
public:
   short             Фильтр();
   double            Сигнал();
                     Зебра(int _число_полос, ENUM_TIMEFRAMES _символ);
                    ~Зебра();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Зебра::Зебра(int _число_полос, ENUM_TIMEFRAMES _таймфрейм)
  {
   число_полос=_число_полос;
   таймфрейм = _таймфрейм;
   ArrayResize(полосы,число_полос);
   for(int i=0; i<число_полос; i++)
     {
      полосы[i]=0;
      }
   
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Зебра::~Зебра()
  {
  }
//+------------------------------------------------------------------+
void Зебра::РасчитатьПолосы()
  {
   Свеча *полоса;
   
   for(int i=0; i<число_полос; i++)
     {
      полоса=new Свеча(i+1,таймфрейм);
      полосы[i]=полоса.Фильтр();
     }
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
short Зебра::Фильтр()
  {
   this.РасчитатьПолосы();
   for(int i=0; i<число_полос; i++)
     {
      if(i==0)
         continue;
      if(полосы[i]==0 || полосы[i-1]==0 || полосы[i]==полосы[i-1])
         return 0;
     }
   
   return (MathPow(-1,(число_полос+1))*полосы[число_полос-1]);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
double Зебра::Сигнал()
  {
   if(Фильтр()==1)
      return (Low[1]);
   if(Фильтр()==-1)
      return (High[1]);
   return(0);
  }
//+------------------------------------------------------------------+
