//+------------------------------------------------------------------+
//|                                                       Сигнал.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict

#include "..\Библиотеки\Перечисления.mqh"
class Сигнал
  {
private:

public:
   ENUM_НАПРАВЛЕНИЕ_СИГНАЛА направление;
   ENUM_TIMEFRAMES таймфрейм;
   int               сила;
   double            уровень;
   bool              наличие;
                     Сигнал();
                    ~Сигнал();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Сигнал::Сигнал()
  {
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Сигнал::~Сигнал()
  {
  }
//+------------------------------------------------------------------+
