//+------------------------------------------------------------------+
//|                                             КомнатаФракталов.mqh |
//|                                Инвестиционная группа Витязи Духа |
//|                                                                  |
//+------------------------------------------------------------------+
#property copyright "Инвестиционная группа Витязи Духа"
#property link      ""
#property version   "1.00"
#property strict
#include "Пик.mqh"
#include "Фрактал.mqh"
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
class КомнатаФракталов
  {
private:
   Фрактал          *фракталы[];
   int               количество;
public:
   void              ДобавитьФрактал(Фрактал &_fraktal);
   void              ДобавитьФрактал(int тип,Пик &_pik);
   void              ЗакрытьКомнату();
   Фрактал           ДостатьФрактал(int _тип,int _глубина);
   Фрактал           ДостатьФрактал(int _номер);
   void              ПоставитьСтрелку(Пик &_пик);
   int               ПоискПоТипу(int _тип,int _глубина);
   int               Количество(){return(количество);}
   bool              ЕстьФракталСТипом(int _тип);
   string            КоматаФракталовВСтроку();
                     КомнатаФракталов();
                    ~КомнатаФракталов();
  };
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
КомнатаФракталов::КомнатаФракталов()
  {
   количество=0;
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
КомнатаФракталов::~КомнатаФракталов()
  {
  }
//+------------------------------------------------------------------+
void КомнатаФракталов::ДобавитьФрактал(Фрактал &_fraktal)
  {
   количество++;
   ArrayResize(фракталы,количество);
   фракталы[количество-1]=new Фрактал(_fraktal);
   _fraktal.ПоставитьСтрелку();
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
void КомнатаФракталов::ДобавитьФрактал(int _тип,Пик &_pik)
  {
   количество++;
   ArrayResize(фракталы,количество);
   фракталы[количество-1]=new Фрактал(_тип,_pik);
   _pik.ПоставитьСтрелку();

  }
//+------------------------------------------------------------------+

string КомнатаФракталов::КоматаФракталовВСтроку()
  {
   string strFract="";
   if(количество!=0)
      for(int i=0; i<количество;i++)
         strFract=strFract+фракталы[i].ФракталВСтроку()+"\n";
   else
      strFract="";
   return(strFract);
  }
//+------------------------------------------------------------------+

int   КомнатаФракталов::ПоискПоТипу(int _тип,int _глубина)
  {
   int номер=-1;
   int глубина=0;
   for(int i=ArraySize(фракталы)-1; i>=0; i--)
     {
      if(фракталы[i].Тип()==_тип)
        {
         номер=i;
         глубина++;
         if(глубина==_глубина)
            break;
        }
     }
   return(номер);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
bool   КомнатаФракталов::ЕстьФракталСТипом(int _тип)
  {
   int номер=-1;
   int глубина=0;
   for(int i=ArraySize(фракталы)-1; i>=0; i--)
     {
      if(фракталы[i].Тип()==_тип)
        {
         номер=i;
         break;
        }
     }
   if(номер < 0)
      return(false);
   else
      return(true);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Фрактал   КомнатаФракталов::ДостатьФрактал(int _тип,int _глубина)
  {
   int номер;
   int глубина=0;
   for(номер=ArraySize(фракталы)-1; номер>=0; номер--)
     {
      if(фракталы[номер].Тип()==_тип)
         глубина++;
      if(глубина==_глубина)
         break;
     }
   return(фракталы[номер]);
  }
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
Фрактал   КомнатаФракталов::ДостатьФрактал(int _номер)
  {
   return(фракталы[_номер-1]);
  }
//+------------------------------------------------------------------+
void КомнатаФракталов::ЗакрытьКомнату()
  {
   ArrayFree(фракталы);
   количество=0;

  }
//+------------------------------------------------------------------+
void  КомнатаФракталов::ПоставитьСтрелку(Пик &_пик)
  {
   _пик.ПоставитьСтрелку();
  }
//+------------------------------------------------------------------+
